# Restaurant Sales report
**EDA and Analysis Ideas for restaurant business**

# File Description:

#### File Format: CSV
#### Columns: This dataset includes columns such as order_id, date, item_name, item_type, item_price, quantity, transaction_amount, transaction_type, received_by, and time_of_sale.
#### Data Size: This file contains 1000 rows and 10 columns.
#### Data Structure: The dataset is organized as a single CSV file, providing information on transactions at a local restaurant.
#### Data Cleaning and Preprocessing: The data has been carefully reviewed and cleaned to address duplicates and missing values, ensuring data quality for analysis.
#### Date of Last Update: The dataset was last updated on March 31, 2023.
#### Special Notes: Please note that the 'transaction_amount' column represents the total transaction amount, derived from the multiplication of 'item_price' and 'quantity' for each item in the order.
#### Data Source: This data was collected from a local restaurant situated near my home and is made available for analysis and educational purposes.

## Data Description:
This dataset captures sales transactions from a local restaurant near my home. It includes details such as the order ID, date of the transaction, item names (representing various food and beverage items), item types (categorized as Fast-food or Beverages), item prices, quantities ordered, transaction amounts, transaction types (cash, online, or others), the gender of the staff member who received the order, and the time of the sale (Morning, Evening, Afternoon, Night, Midnight). The dataset offers a valuable snapshot of the restaurant's daily operations and customer behavior.

### Columns:

    order_id: a unique identifier for each order.
    date: date of the transaction.
    item_name: name of the food.
    item_type: category of item (Fastfood or Beverages).
    item_price: price of the item for 1 quantity.
    Quantity: how much quantity the customer orders.
    transaction_amount: the total amount paid by customers.
    transaction_type: payment method (cash, online, others).
    received_by: gender of the person handling the transaction.
    time_of_sale: different times of the day (Morning, Evening, Afternoon, Night, Midnight).

## Import libs and read the dataset

In [1]:
import pandas as pd
import numpy as np
import matplotlib as mp

In [2]:
df=pd.read_csv("Balaji Fast Food Sales (1).csv")

## Basic understanding of dataset

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            1000 non-null   int64
 1   date                1000 non-null   object
 2   item_name           1000 non-null   object
 3   item_type           1000 non-null   object
 4   item_price          1000 non-null   int64
 5   quantity            1000 non-null   int64
 6   transaction_amount  1000 non-null   int64
 7   transaction_type    893 non-null    object
 8   received_by         1000 non-null   object
 9   time_of_sale        1000 non-null   object
dtypes: int64(4), object(6)
memory usage: 78.3+ KB

In [8]:
print('Total Number of row : ',df.shape[0])
print('Total Number of columns : ',df.shape[1])

Total Number of row :  1000
Total Number of columns :  10

In [9]:
print('Size of the dataset : ',df.size)

Size of the dataset :  10000

### Inference

##### * There are 107 null values in the transaction type column

##### * There is no duplicates in the dataset

In [11]:
df[df.duplicated()].sum()

order_id              0
date                  0
item_name             0
item_type             0
item_price            0
quantity              0
transaction_amount    0
transaction_type      0
received_by           0
time_of_sale          0
dtype: object

### Check the datatype and change if it is neccessary

In [18]:
df['date']=df['date'].str.replace('-','/')

In [19]:
df

,order_id,date,item_name,item_type,item_price,quantity,transaction_amount,transaction_type,received_by,time_of_sale
0,1,07/03/2022,Aalopuri,Fastfood,20,13,260,NaN,Mr.,Night
1,2,8/23/2022,Vadapav,Fastfood,20,15,300,Cash,Mr.,Afternoon
2,3,11/20/2022,Vadapav,Fastfood,20,1,20,Cash,Mr.,Afternoon
3,4,02/03/2023,Sugarcane juice,Beverages,25,6,150,Online,Mr.,Night
4,5,10/02/2022,Sugarcane juice,Beverages,25,8,200,Online,Mr.,Evening
...,...,...,...,...,...,...,...,...,...,...
995,996,3/19/2023,Frankie,Fastfood,50,10,500,NaN,Mrs.,Evening
996,997,9/20/2022,Sandwich,Fastfood,60,7,420,NaN,Mr.,Evening
997,998,1/26/2023,Sandwich,Fastfood,60,13,780,NaN,Mr.,Evening
998,999,8/27/2022,Panipuri,Fastfood,20,5,100,NaN,Mrs.,Afternoon
999,1000,5/29/2022,Aalopuri,Fastfood,20,3,60,Online,Mrs.,Midnight

In [20]:
df['date']=pd.to_datetime(df['date'])

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            1000 non-null   int64
 1   date                1000 non-null   datetime64[ns]
 2   item_name           1000 non-null   object
 3   item_type           1000 non-null   object
 4   item_price          1000 non-null   int64
 5   quantity            1000 non-null   int64
 6   transaction_amount  1000 non-null   int64
 7   transaction_type    893 non-null    object
 8   received_by         1000 non-null   object
 9   time_of_sale        1000 non-null   object
dtypes: datetime64[ns](1), int64(4), object(5)
memory usage: 78.3+ KB

### Separate the numerical and catogorical column

In [27]:
col=df.columns.to_list()

In [29]:
num=df.select_dtypes(include=np.number).columns.to_list()

In [31]:
cat=df.select_dtypes(exclude=np.number).columns.to_list()

In [34]:
print('Numeric vriable : ',num)
print('Catogorical variable : ',cat)

Numeric vriable :  ['order_id', 'item_price', 'quantity', 'transaction_amount']
Catogorical variable :  ['date', 'item_name', 'item_type', 'transaction_type', 'received_by', 'time_of_sale']

### Discriptive stat

##### Measures of central tendency

In [37]:
df[num].mean()

order_id              500.500
item_price             33.315
quantity                8.162
transaction_amount    275.230
dtype: float64

In [38]:
for i in num:
    print(f'Mean of column {i} is : {df[i].mean()}')

Mean of column order_id is : 500.5
Mean of column item_price is : 33.315
Mean of column quantity is : 8.162
Mean of column transaction_amount is : 275.23

In [42]:
for i in num:
    print(f'Medium of column {i} is : {df[i].median()}')

Medium of column order_id is : 500.5
Medium of column item_price is : 25.0
Medium of column quantity is : 8.0
Medium of column transaction_amount is : 240.0

In [44]:
for i in cat:
    print(f'Mode of column {i} is : {df[i].mode()}')
    print('     ')

Mode of column date is : 0   2022-05-09
1   2022-08-31
2   2022-10-11
Name: date, dtype: datetime64[ns]

Mode of column item_name is : 0    Cold coffee
Name: item_name, dtype: object

Mode of column item_type is : 0    Fastfood
Name: item_type, dtype: object

Mode of column transaction_type is : 0    Cash
Name: transaction_type, dtype: object

Mode of column received_by is : 0    Mr.
Name: received_by, dtype: object

Mode of column time_of_sale is : 0    Afternoon
1        Night
Name: time_of_sale, dtype: object

In [46]:
for i in num:
    print(f'Mode of column {i} is : {df[i].mode()}')
    print('     ')

Mode of column order_id is : 0         1
1         2
2         3
3         4
4         5
       ...
995     996
996     997
997     998
998     999
999    1000
Name: order_id, Length: 1000, dtype: int64

Mode of column item_price is : 0    20
Name: item_price, dtype: int64

Mode of column quantity is : 0    13
Name: quantity, dtype: int64

Mode of column transaction_amount is : 0    300
Name: transaction_amount, dtype: int64

In [45]:
for i in cat:
    print(f'Value count of column {i} is : {df[i].value_counts()}')
    print('     ')

Value count of column date is : date
2022-10-11    8
2022-05-09    8
2022-08-31    8
2023-03-19    7
2023-02-03    7
             ..
2022-06-12    1
2022-04-15    1
2022-05-17    1
2022-07-23    1
2022-06-14    1
Name: count, Length: 348, dtype: int64

Value count of column item_name is : item_name
Cold coffee        161
Sugarcane juice    153
Panipuri           150
Frankie            139
Aalopuri           134
Vadapav            134
Sandwich           129
Name: count, dtype: int64

Value count of column item_type is : item_type
Fastfood     686
Beverages    314
Name: count, dtype: int64

Value count of column transaction_type is : transaction_type
Cash      476
Online    417
Name: count, dtype: int64

Value count of column received_by is : received_by
Mr.     512
Mrs.    488
Name: count, dtype: int64

Value count of column time_of_sale is : time_of_sale
Night        205
Afternoon    205
Evening      201
Midnight     199
Morning      190
Name: count, dtype: int64

In [48]:
for i in cat:
    print(f'Unique Value of column {i} is : {df[i].unique()}')
    print('     ')

Unique Value of column date is : <DatetimeArray>
['2022-07-03 00:00:00', '2022-08-23 00:00:00', '2022-11-20 00:00:00',
 '2023-02-03 00:00:00', '2022-10-02 00:00:00', '2022-11-14 00:00:00',
 '2022-05-03 00:00:00', '2022-12-22 00:00:00', '2022-06-10 00:00:00',
 '2022-09-16 00:00:00',
 ...
 '2023-03-06 00:00:00', '2023-02-21 00:00:00', '2023-02-19 00:00:00',
 '2023-01-07 00:00:00', '2022-09-24 00:00:00', '2022-06-29 00:00:00',
 '2022-11-21 00:00:00', '2023-01-22 00:00:00', '2023-03-30 00:00:00',
 '2022-06-14 00:00:00']
Length: 348, dtype: datetime64[ns]

Unique Value of column item_name is : ['Aalopuri' 'Vadapav' 'Sugarcane juice' 'Panipuri' 'Frankie' 'Sandwich'
 'Cold coffee']

Unique Value of column item_type is : ['Fastfood' 'Beverages']

Unique Value of column transaction_type is : [nan 'Cash' 'Online']

Unique Value of column received_by is : ['Mr.' 'Mrs.']

Unique Value of column time_of_sale is : ['Night' 'Afternoon' 'Evening' 'Morning' 'Midnight']

## Measure of dispersion

In [56]:
list(map(lambda x,y:f'{x-y}',df[num].max(),df[num].min()))

['999', '40', '14', '880']

In [57]:
for i in num:
    print('Variance of column',i,'is',df[i].var())

Variance of column order_id is 83416.66666666667
Variance of column item_price is 222.65843343343138
Variance of column quantity is 19.475231231231273
Variance of column transaction_amount is 41780.57767767783

In [58]:
for i in num:
    print('Standard deviation of column ',i,'is',df[i].std())

Standard deviation of column  order_id is 288.8194360957494
Standard deviation of column  item_price is 14.921743645882387
Standard deviation of column  quantity is 4.413075031226104
Standard deviation of column  transaction_amount is 204.4029786418922

In [59]:
for i in num:
    print('IQR value of column ',i,'is',df[i].quantile(0.75)-df[i].quantile(0.25))

IQR value of column  order_id is 499.5
IQR value of column  item_price is 30.0
IQR value of column  quantity is 8.0
IQR value of column  transaction_amount is 240.0

### Measures of shape

##### 1. Skewness

In [67]:
for i in num:
    print(f"Skewness value of {i} is {df[i].skew()}")

Skewness value of order_id is 0.0
Skewness value of item_price is 0.6250044803515558
Skewness value of quantity is -0.05129947454908782
Skewness value of transaction_amount is 1.052643178230624

##### Inference from Skewness

The item prices and transaction amounts show a tendency towards larger values, indicating potential outliers or high-value products/transactions.
The quantity distribution is fairly balanced, suggesting consistent sales patterns.
Further analysis with visualizations (like histograms or box plots) would provide a better understanding of the data distribution and potential outliers.

##### 2. Kurtosis

In [71]:
for i in num:
    print(f"Kurtosis value of {i} is {df[i].kurtosis()}")

Kurtosis value of order_id is -1.2
Kurtosis value of item_price is -1.173262217524134
Kurtosis value of quantity is -1.2416861155903576
Kurtosis value of transaction_amount is 0.6554065709917558

##### Inference from Kurtosis

The kurtosis values support the inferences made from the skewness values.
The data for item prices, quantities, and potentially transaction amounts appear to have fewer extreme values than a normal distribution.
Order IDs, as expected, exhibit a platykurtic distribution due to their sequential nature.

##### 3. Covariance

In [77]:
df[num].cov()

                        order_id   item_price    quantity  transaction_amount
order_id            83416.666667   159.577077   13.185185         2595.785786
item_price            159.577077   222.658433    3.316286         1943.606156
quantity               13.185185     3.316286   19.475231          660.122863
transaction_amount   2595.785786  1943.606156  660.122863        41780.577678

All variables are positively correlated with each other. transaction_amount has the highest covariance with all other variables, indicating a strong relationship. item_price and quantity have moderate covariance, suggesting a moderate relationship.

##### 4. Corelation

In [78]:
df[num].corr()

                    order_id  item_price  quantity  transaction_amount
order_id            1.000000    0.037028  0.010345            0.043970
item_price          0.037028    1.000000  0.050361            0.637238
quantity            0.010345    0.050361  1.000000            0.731806
transaction_amount  0.043970    0.637238  0.731806            1.000000

The correlation matrix suggests that quantity has a stronger influence on transaction_amount than item_price, although both factors play a role. order_id appears to be unrelated to the other variables.

### 5 points summary for num and cat

In [79]:
df[num].describe()

          order_id   item_price     quantity  transaction_amount
count  1000.000000  1000.000000  1000.000000         1000.000000
mean    500.500000    33.315000     8.162000          275.230000
std     288.819436    14.921744     4.413075          204.402979
min       1.000000    20.000000     1.000000           20.000000
25%     250.750000    20.000000     4.000000          120.000000
50%     500.500000    25.000000     8.000000          240.000000
75%     750.250000    50.000000    12.000000          360.000000
max    1000.000000    60.000000    15.000000          900.000000

#### Inference

Order IDs are sequential numbers.
Item prices have a right-skewed distribution with a wider range compared to quantities.
Quantities have a relatively symmetrical distribution with a smaller range compared to item prices.
Transaction amounts have a right-skewed distribution with a wider range, likely influenced by both item prices and quantities.

In [84]:
df[cat].describe(include=object)

          item_name item_type transaction_type received_by time_of_sale
count          1000      1000              893        1000         1000
unique            7         2                2           2            5
top     Cold coffee  Fastfood             Cash         Mr.        Night
freq            161       686              476         512          205

#### Inference

The dataset contains 1000 transactions with 7 unique item names, 2 item types, 2 transaction types, 2 recipients, and 5 time of sale categories. Cold coffee is the most frequent item, Fastfood is the most common item type, Cash is the preferred payment, Mr. is the most frequent recipient, and Night is the peak sales time.